[
  {
    "id": "img1",
    "title": "Blood Amber Figurine of a Child Riding a Sheep",
    "text": "Unearthed in 2015 from a Cao Wei royal tomb in Xizhu Village, Luoyang. This tomb possibly belongs to Princess Pingyuan, Cao Shu, the beloved daughter of Emperor Ming (Cao Rui). The figurine stands about 3 cm tall and is carved from blood amber. It depicts a child gripping the horns of a sheep with both hands, seated atop its back. Such image of riding a sheep often symbolises transcendence and the attainment of immortality. A stone plaque inscribed with the words 'Plain Carving of a Child Riding a Sheep No. 1' was also unearthed from the same tomb.",
    "location": "Luoyang",
    "location_en": "Luoyang",
    "period": "Wei-Jin",
    "period_en": "Three Kingdoms"
  },
  {
    "id": "img2",
    "title": "Seal Impression of the Grand Administrator of Shu Commandery",
    "text": "A seal impression is a remnant of ancient sealing practices. In those days, official documents were primarily written on bamboo or wooden slips. After bundling these slips with strings, a groove would be left at the knot, into which a lump of clay was pressed and stamped with a seal. To access the document, the seal impression had to be broken first. Any sign of tampering on the impression indicated that the document might have been opened without authorisation. This particular seal impression reads 'Stamp of the Grand Administrator of Shu Commandery'. As paper gradually replaced bamboo slips as the primary writing material, this sealing method also slowly disappeared from use.",
    "location": "Chengdu",
    "location_en": "Chengdu",
    "period": "Han",
    "period_en": "Han"
  },
    {
    "id": "img3",
    "title": "Xue Qiu's Wooden Name Plaque",
    "text": "This name plaque was unearthed from a tomb discovered at a construction site in Nanjing. Dating to the Three Kingdoms period, the tomb belonged to Xue Qiu, who was likely of the same clan as Xue Zong, a prominent minister of Wu. At the time, name plaques were used not only in daily life but also placed in tombs to accompany the deceased into the afterlife. The leftmost plaque bears the inscription:'Commandant of Breaking Spears, the noble Xue Qiu of Anping Village, Dong Township, Zhu County, Pei State, aged sixty-six, courtesy name Zichun.' Such a plaque likely served as a form of identification for the deceased to report to the authorities of the underworld, vividly embodying the belief in treating the dead as if they were still living.",
    "location": "Nanjing",
    "location_en": "Nanjing",
    "period": "Wei-Jin",
    "period_en": "Three Kingdoms"
  },
    {
    "id": "img4",
    "title": "Du Tiger Tally",
    "text": "This bronze military tally from the Warring States period is the left half of a tiger tally, measuring ~4 cm in height and ~10 cm in length. The tally is cast in the form of a striding tiger with its head held high. The surface bears an inscription in small seal script, inlaid using the gold-inlay technique. The inscription outlines the use of this tally: the right half was held by the ruler, while the left half was entrusted to the military commander stationed in Du. To mobilise more than fifty armoured soldiers, the two halves had to be joined and verified before the order could be carried out. However, in urgent situations such as beacon fires signalling imminent threats, the usual verification could be bypassed to allow immediate deployment. The inscription embodies the Qin state's ritual hierarchy, which regarded the right as superior, and also illustrates its highly centralised system of military control.",
    "location": "XA",
    "location_en": "Xi'an",
    "period": "Q&PQ",
    "period_en": "Warring States"
  },
  {
    "id": "img5",
    "title": "Zhibai Wuzhu (直百五銖)",
    "text": "The Zhibai Wuzhu was an important coin minted by the Shu during the Three Kingdoms period. The coin is round on the outside and square on the inside, and the inscription is arranged in a circular reading order — top, bottom, right, then left. The characters “Zhibai” were written in clerical script, while “Wuzhu” were in small seal script. The character “直” is a phonetic loan for “值” (value), and “Wuzhu” refers to a standard coin type from the Han dynasty. Thus, “Zhibai Wuzhu” literally means “Coin worth one hundred Wuzhu”. Archaeological discoveries of these coins far outnumbered those of their Wei and Wu counterparts, and they saw wide circulation — remaining in use among the populace even into the Southern Liang dynasty, some 200 years later.",
    "location": "Chengdu",
    "location_en": "Chengdu",
    "period": "Wei-Jin",
    "period_en": "Three Kingdoms"
  },
  {
    "id": "img6",
    "title": "Tang Sancai Camel",
    "text": "This camel figurine was unearthed from the joint tomb of General An Pu and his wife, located in the southern suburbs of Luoyang. An Pu, a Sogdian, was born in the Western Regions, died in Chang’an, and buried in Luoyang — a life both far-reaching and extraordinary. The figurine is vivid and lifelike in form: its head is held high, mouth open in a braying cry; its back is richly adorned with a floral seating carpet and travel gear, such as a saddlebag shaped like a beast's face. As a remarkable example of Tang Sancai — literally meaning “Tang three colors” — the piece features a harmonious blend of white, green, and brown glazes, vividly reflecting the prosperity of the Silk Road trades and the rich cultural interactions that flourished during the period.",
    "location":"Luoyang",
    "location_en": "Luoyang",
    "period": "Tang",
    "period_en": "Tang"
  },
  {
    "id":"img7",
    "title":"The Multi-faced Seal of Dugu Xin",
    "text":"This seal belonged to Dugu Xin, a Xianbei noble and one of the Eight Pillar-Generals of Western Wei. Carved from jet stone, the seal is composed of 26 square and triangular faces of varying sizes. Among them, 14 square faces bear engraved inscriptions. The inscriptions fall into three categories: (1) for issuing official documents, (2) for submitting memorials to the emperor, and (3) for private correspondence. The seal’s unique design makes it a distinctive and exceptional example among all ancient seals known to date.",
    "location": "XA",
    "location_en": "Xi'an",
    "period": "N/S Dynasties",
    "period_en": "Western Wei"
  },
  {
    "id":"img8",
    "title":"Celadon Tiger Vessel",
    "text":"The Tiger Vessel, taking its name from its distinctive tiger-like form, originated during the Warring States period and became widespread from the Han dynasty through the North/South Dynasties. During the Southern Dynasties, Celadon Tiger Vessels were commonly placed as burial goods in tombs. They typically feature a tiger’s head raised upward, forming the spout, with an arched handle on the back serving as the grip. Scholars remain divided over their intended function: some propose that they were used to hold water, while others argue that they served as chamber pots.",
    "location": "Nanjing",
    "location_en": "Nanjing",
    "period": "N/S Dynasties",
    "period_en": "Southern Dynasties"
  },
  {
    "id":"img9",
    "title":"Jade Burial Suit",
    "text":"This jade burial suit was unearthed from the tomb of Liu Fei, Prince of Jiangdu. A son of Emperor Jing of Han and elder half-brother to Emperor Wu, Liu Fei took part in quelling the famous Rebellion of the Seven States. The suit is composed of over two thousand individual jade pieces, meticulously strung together — a process that would have taken several years to complete. In the Han dynasty, it was believed that if the body remained uncorrupted after death and the vital “qi” within could be preserved, one might ascend to the realm of the immortals. The most effective way to achieve this, it was thought, was to tightly encase the corpse in materials of eternal endurance, like jade. Today, the jade burial suits displayed in museums may, in a symbolic sense, have fulfilled their owners' hopes for everlasting life.",
    "location": "Nanjing",
    "location_en": "Nanjing",
    "period": "Han",
    "period_en": "Han"
  },
  {
    "id":"img10",
    "title":"Cao Quan Stele",
    "text":"The Cao Quan Stele — or The Stele of Cao Quan, Magistrate of Heyang — was carved in the second year of Zhongping during the Eastern Han dynasty, and was later unearthed in Heyang County during the Ming Wanli period. The inscription provides a detailed account of Magistrate Cao Quan's lineage, life, and achievements, including his suppression of the Yellow Turban Rebellion. The stele stands approximately 3 meters tall and 1.5 meters wide, bearing a total of 1165 characters. With its graceful, expressive strokes, the work has long stood as a canonical exemplar of clerical script. To this day, it remains one of the most esteemed Han dynasty steles and serves as a valued touchstone for students of calligraphy.",
    "location": "XA",
    "location_en": "Xi'an",
    "period": "Han",
    "period_en": "Han"
  },
  {
    "id":"img11",
    "title":"White Jade Cup",
    "text":"This white jade cup was excavated from a Luoyang tomb dating to the Wei period. Although the tomb had been looted and its grave goods left scattered and incomplete, this cup was fortunately preserved and intact. An inscription reading “Eighth year of Zhengshi, eighth month” carved on surviving iron curtain-frame components dates the burial to the reign of Cao Fang. The cup stands 13 cm high with a mouth diameter of 5 cm, and is carved from a single piece of clear, lustrous white jade. Entirely undecorated, the cup relies on the simplicity and elegance of its form, embodying the ideal of “beauty inherent in nature.”",
    "location": "Luoyang",
    "location_en": "Luoyang",
    "period": "Wei-Jin",
    "period_en": "Three Kingdoms"
  },
  {
    "id":"img12",
    "title":"Tiger-Motif Bronze Dagger-Axe",
    "text":"The bronze dagger-axe measures 25.2 cm in length, 13.6 cm in width, and 2.4 cm in thickness. Both sides of the rear portion of the blade are adorned with relief carvings of tiger heads, their jaws gaping wide; behind them, incised lines delineate the bodies of the tigers. Portions of the blade are also decorated with symbols associated with the Bashu culture. Among Bashu bronze artifacts, tiger motifs are among the most frequently employed decorative themes, corresponding to accounts in the Book of the Later Han that describe the Ba people’s veneration of the tiger. Comparable tiger-decorated weapons have been unearthed at sites in Chongqing and elsewhere in the region. ",
    "location": "Chengdu",
    "location_en": "Chengdu",
    "period": "Q&PQ",
    "period_en": "Warring States"
  }
]
