[
  {
    "id": "img1",
    "title": "Blood Amber Figurine of a Child Riding a Sheep",
    "text": "Unearthed in 2015 from a Cao Wei royal tomb in Xizhu Village, Luoyang. This tomb possibly belongs to Princess Pingyuan, Cao Shu, the beloved daughter of Emperor Ming (Cao Rui). The figurine stands about 3 cm tall and is carved from blood amber. It depicts a child gripping the horns of a sheep with both hands, seated atop its back. Such image of riding a sheep often symbolises transcendence and the attainment of immortality. A stone plaque inscribed with the words 'Plain Carving of a Child Riding a Sheep No. 1' was also unearthed from the same tomb.",
    "location": "Luoyang",
    "location_en": "Luoyang",
    "period": "Wei-Jin",
    "period_en": "Three Kingdoms"
  },
  {
    "id": "img2",
    "title": "Seal Impression of the Grand Administrator of Shu Commandery",
    "text": "A seal impression is a remnant of ancient sealing practices. In those days, official documents were primarily written on bamboo or wooden slips. After bundling these slips with strings, a groove would be left at the knot, into which a lump of clay was pressed and stamped with a seal. To access the document, the seal impression had to be broken first. Any sign of tampering on the impression indicated that the document might have been opened without authorisation. This particular seal impression reads 'Stamp of the Grand Administrator of Shu Commandery'. As paper gradually replaced bamboo slips as the primary writing material, this sealing method also slowly disappeared from use.",
    "location": "Chengdu",
    "location_en": "Chengdu",
    "period": "Han",
    "period_en": "Han"
  },
    {
    "id": "img3",
    "title": "Xue Qiu's Wooden Name Plaque",
    "text": "This name plaque was unearthed from a tomb discovered at a construction site in Nanjing. Dating to the Three Kingdoms period, the tomb belonged to Xue Qiu, who was likely of the same clan as Xue Zong, a prominent minister of Wu. At the time, name plaques were used not only in daily life but also placed in tombs to accompany the deceased into the afterlife. The leftmost plaque bears the inscription:'Commandant of Breaking Spears, Resident of Anping Village, Eastern Township of Zhu City, Pei State, the noble Xue Qiu, aged sixty-six, courtesy name Zichun.' Such a plaque likely served as a form of identification for the deceased to report to the authorities of the underworld, vividly embodying the belief in treating the dead as if they were still living.",
    "location": "Nanjing",
    "location_en": "Nanjing",
    "period": "Wei-Jin",
    "period_en": "Three Kingdoms"
  },
    {
    "id": "img4",
    "title": "Du Tiger Tally",
    "text": "This bronze military tally from the Warring States period is the left half of a tiger tally, measuring ~4 cm in height and ~10 cm in length. The tally is cast in the form of a striding tiger with its head held high. The surface bears an inscription in small seal script, inlaid using the gold-inlay technique. The inscription outlines the use of this tally: the right half was held by the ruler, while the left half was entrusted to the military commander stationed in Du. To mobilise more than fifty armoured soldiers, the two halves had to be joined and verified before the order could be carried out. However, in urgent situations such as beacon fires signalling imminent threats, the usual verification could be bypassed to allow immediate deployment. The inscription embodies the Qin state's ritual hierarchy, which regarded the right as superior, and also illustrates its highly centralised system of military control.",
    "location": "XA",
    "location_en": "Xi'an",
    "period": "Q&PQ",
    "period_en": "Warring States"
  }
]
