[
  {
    "id": "img1",
    "title": "血珀騎羊俑",
    "text": "2015年出土於河南洛陽伊濱區窯店鎮西朱村的曹魏大墓，墓主推測為曹魏皇室成員，或係魏明帝曹叡之愛女——平原公主曹淑。此俑高約3釐米，以血珀雕琢而成，呈現一童子雙手執握羊角、騎坐羊背之姿。騎羊形象常含得道昇仙之意。同墓亦出土刻有「白畫騎羊兒一」字樣石牌，「白畫」即素刻之意。",
    "location": "Luoyang",
    "location_zh": "洛陽",
    "period": "Wei-Jin",
    "period_zh": "三國"
  },
  {
    "id": "img2",
    "title": "蜀郡太守章封泥",
    "text": "封泥是古代使用印章的實物遺存。當時的文書主要寫在竹木簡牘上，簡牘用繩子捆紮後，會在打結處留出一個凹槽，填入泥塊並蓋上印章。如果要查閱文書，就必須先破壞封泥；一旦封泥出現破損痕跡，就說明文件可能被私自拆開過。後來隨著紙張取代簡牘成為主要書寫材料，封泥這種形式就逐漸消失了。",
    "location": "Chengdu",
    "location_zh": "成都",
    "period": "Han",
    "period_zh": "漢"
  },
    {
    "id": "img3",
    "title": "薛秋木名刺",
    "text": "這枚名刺出土於南京一處工地內發現的墓地。根據墓中隨葬品判斷，墓葬年代為三國東吳時期，墓主人薛秋可能與東吳名臣薛綜同宗。名刺在當時不僅用於日常生活，也會隨葬給逝者使用。最左側的名刺上寫有：「折鋒校尉沛國竹邑東鄉安平里公乘薛秋年六十六字子春」，詳細介紹了籍貫、名字等細節。這很可能是墓主人向陰間官府報到的憑證，生動體現了「事死如事生」的喪葬觀念。",
    "location": "Nanjing",
    "location_zh": "南京",
    "period": "Wei-Jin",
    "period_zh": "三國"
  },
    {
    "id": "img4",
    "title": "杜虎符",
    "text": "這枚戰國時期的青銅兵符是虎符的左半部分，高約4公分，長10公分。虎符造型為一隻昂首闊步的猛虎。虎符表面以錯金工藝鐫刻著9行共40字的小篆銘文，內容明確規定了兵符的使用制度：右半符由國君執掌，左半符交由杜地軍事長官保管。凡需調動五十名以上甲士時，必須將杜地的左符與國君的右符相合驗證，方可執行調兵命令。但遇到烽火示警等緊急軍情時，則可破例不經驗符直接發兵。 這段銘文體現了秦國「以右為尊」的禮制觀念，也反映出其高度集中的軍事指揮體系。",
    "location": "XA",
    "location_zh": "西安",
    "period": "Q&PQ",
    "period_zh": "戰國"
  },
   {
    "id": "img5",
    "title": "直百五銖",
    "text": "直百五銖乃三國時期蜀漢政權所鑄造的重要貨幣。此錢外圓內方，錢文以「上、下、右、左」的方式排列，其中「直百」二字為隸書，「五銖」為小篆。「直」字為「值」之通假，「五銖」本為漢代貨幣，故「直百五銖」之意即幣值百元的五銖。從考古發現來看，蜀漢鑄幣在數量上均遠超同期魏、吳兩國，且影響甚廣，直至兩百多年后的南朝梁武帝時仍在民間流通。",
    "location": "Chengdu",
    "location_zh": "成都",
    "period": "Wei-Jin",
    "period_zh": "三國"
   },
   {
    "id": "img6",
    "title": "唐三彩駱駝",
    "text":"這件駱駝俑出土於洛陽南郊的定遠將軍安菩夫婦合葬墓。墓主人安菩作為一個粟特人，生於西域，死於長安，葬於洛陽，人生軌跡極富傳奇色彩。駱駝俑造型生動傳神：頭部高昂，張口嘶鳴；背部裝飾考究，鋪有精美花毯，並有獸面紋馱囊等行裝。作為典型的唐三彩作品，此俑以白、綠、褐三色釉彩交織渲染，色澤斑斕絢麗。它不僅展現了唐代三彩工藝的高超水準，更是當時絲綢之路商貿繁榮與文化交融的真實寫照。",
    "location":"Luoyang",
    "location_zh": "洛陽",
    "period": "Tang",
    "period_zh": "唐"
   },
   {
    "id": "img7",
    "title":"獨孤信多面印",
    "text":"這枚印章屬於西魏八柱國之一的鮮卑貴族獨孤信。印章以煤精石為材，由26個大小各異的正方形與三角形構成，其中14個正方形印面鐫刻有不同印文。其印文內容可分為三類：一為簽發公文之用，二為上奏皇帝之用，三為私人書信之用。此印形制獨特，在迄今所見的古代印章中實屬罕見。",
    "location": "XA",
    "location_zh": "西安",
    "period": "N/S Dynasties",
    "period_zh": "西魏"
   },
   {
    "id":"img8",
    "title":"青瓷虎子",
    "text":"虎子源起於戰國，盛行於漢代至六朝，因其器形肖似虎狀而得名。青瓷虎子是六朝墓葬中常見的隨葬品，多作仰首之態，以虎首為口，并在虎背設有拱形提梁作爲把手。關於青瓷虎子的用途，學界存在盛水與尿壺兩種觀點，尚無定論。",
    "location": "Nanjing",
    "location_zh": "南京",
    "period": "N/S Dynasties",
    "period_zh": "南朝"
   },
      {
    "id":"img9",
    "title":"江都王金縷玉衣",
    "text":"這件金縷玉衣出土於江都王劉非的墓葬中。劉非是漢景帝劉啟之子，也是漢武帝劉徹同父異母的兄長，曾參與平定著名的「七國之亂」。整件玉衣由兩千餘片玉石編綴，需耗時數年方可完成。漢代盛行神仙思想，時人普遍相信，若死後肉身不腐，保住體內之「氣」，便可登仙永生。而實現肉身不朽的最佳方式，正是以金玉這類亙古不壞的材質嚴密包裹遺體。如今，陳列於博物館中的金縷玉衣，或許真的以某種形式，完成了主人不朽的心願。",
    "location": "Nanjing",
    "location_zh": "南京",
    "period": "Han",
    "period_zh": "漢"
   },
  {
    "id":"img10",
    "title":"曹全碑",
    "text":"《曹全碑》，全稱《漢郃陽令曹全碑》，刻於東漢中平二年，於明萬曆年間在陝西郃陽縣出土。碑文詳盡記述了郃陽令曹全的家世、生平與政績，其中包括其鎮壓黃巾起事的相關事蹟。碑體高約3米，寬約1.5米，共1165字。書法風格秀麗舒展、逸致翩翩，素來為隸書研習的經典範本，在漢碑中夙負盛名。",
    "location": "XA",
    "location_zh": "西安",
    "period": "Han",
    "period_zh": "漢"
   },
  {
    "id":"img11",
    "title":"白玉杯",
    "text":"這尊白玉杯出土於一座洛陽的曹魏墓。該墓葬曾遭盜掘，隨葬品已散亂不全，但這隻完美無瑕的白玉杯卻幸運地保存完好。墓內留存的鐵帷帳構件上刻有「正始八年八月」的銘文，由此確知墓葬年代為魏齊王芳時期。玉杯高13釐米，口徑5釐米，通體由晶瑩透亮的白玉雕琢而成。它雖無任何紋飾，卻以素雅純淨的質感，展現了「美在天然」的至高意趣。",
    "location":"Luoyang",
    "location_zh": "洛陽",
    "period": "Wei-Jin",
    "period_zh": "三國"
   },
  {
    "id":"img12",
    "title":"虎纹铜戈",
    "text":"此銅戈長25.2釐米，寬13.6釐米，厚2.4釐米。戈體後部兩面均飾半浮雕虎首，虎口大張，其後則有陰刻虎身，局部亦飾巴蜀符號。在巴蜀文化青銅器中，虎紋是最為常見的主題紋飾之一，且均位於器物的顯著位置，與《後漢書》所載巴人崇虎之俗相合。同類虎紋兵器於重慶等地亦多有出土。",
    "location": "Chengdu",
    "location_zh": "成都",
    "period": "Q&PQ",
    "period_zh": "戰國"
   },
    {
    "id":"img13",
    "title":"舞馬銜杯紋銀壺",
    "text":"舞馬銜杯紋銀壺器身扁圓，造型仿自北方遊牧民族的皮囊壺，體現了此時不同民族之間的文化交融。壺身刻有兩匹舞馬，奮首鼓尾，銜杯跪拜，生動還原了唐代詩文所述宮廷舞馬「屈膝銜杯」，為唐玄宗祝壽的場景。安史之亂後，玄宗倉皇逃離，舞馬四散，盛行一時的舞馬祝壽亦隨之消逝。此壺也因而成爲唐朝盛極而衰的特殊見證。",
    "location": "XA",
    "location_zh": "西安",
    "period": "Tang",
    "period_zh": "唐"
   }
      
]